// ! 마우스 이벤트
// ? click: 사용자가 HTML 요서를 클릭할 때 이벤트가 발생합니다.
// ? dbclick: 사용자가 HTML 요소를 더블클릭할 때 이벤트가 발생합니다.
// ? mousedown: 사용자가 요소 위에서 마우스 버튼을 눌렀을 때 이벤트가 발생합니다.
// ? mousemove: 사용자가 요소 위에서 마우스 포인터를 움직일 때 이벤트가 발생합니다.
// ? mouseover: 마우스 포인터가 요소 위로 옮겨질 때 이벤트가 발생합니다.
// ? mouseout: 마우스가 요소를 벗어 날 때 이벤트가 발생합니다.
// ? mouseup: 사용자가 요소 위에 놓인 마우스 버튼에서 손을 뗄 때 이벤트가 발생합니다.

// ! 키보드 이벤트
// ? keydown: 사용자가 키를 누르는 동안 이벤트가 발생합니다.
// ? keypress: 사용자가 키를 눌렀을 때 이벤트가 발생합니다.
// ? keyup: 사용자가 키에서 손을 뗄 때 이벤트가 발생합니다.

// ! 문서 로딩 이벤트
// ? abort: 문서가 완전히 로딩되기 전에 불러오기를 멈췄을 때 이벤트가 발생합니다.
// ? error: 문서가 정확히 로딩되지 않았을 때 이벤트가 발생합니다.
// ? load: 문서 로딩이 끝나면 이벤트가 발생합니다.
// ? resize: 문서 화면 크기가 바뀌었을 때 이벤트가 발생합니다.
// ? scroll: 문서 화면이 스크롤되었을 때 이벤트가 발생합니다.
// ? unload: 문서에서 벗어날 때 이벤트가 발생합니다.

// ! 폼 이벤트
// ? blur: 폼 요소에 포커스를 잃었을 때 이벤트가 발생합니다.
// ? change: 목록에서 체크 상태 등이 변경되면 이벤트가 발생합니다. <input>, <select>, <textarea> 태그에서 사용합니다.
// ? focus: 폼 요소에 포커스가 놓였을 때 이벤트가 발생합니다. <label>, <select>, <textarea>, <button>, 태그에서 사용됩니다.
// ? reset: 폼이 리셋되었을 때 이벤트가 발생합니다.
// ? submit: submit 버튼을 클릭했을 때 이벤트가 발생합니다.

// ...